ГрумингСалон/BusinessProcesses/ДорегистрацияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<BusinessProcess>
		<Properties>
			<Name>ДорегистрацияПользователя</Name>
			<Task>Task.ЗадачиИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияПотверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

ГрумингСалон/BusinessProcesses/ДорегистрацияПользователя/Ext/ObjectModule.bsl
Процедура ПометкаНаУдалениеПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Пользователь = Справочники.Пользователи.НайтиПоНаименованию(Пользователь);
	ПользовательПУ = Пользователь.ПолучитьОбъект();
	ПользовательПУ.ПометкаУдаления = Истина;
	ПользовательПУ.Записать();
	
КонецПроцедуры

Процедура КлиентПотвердилРегистрациюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если БизнесПроцессы.ДорегистрацияПользователя.ПроверитьОтветПользователя(Ссылка) = "1" Тогда
		Результат = Истина;
		РегистрацияПотверждена = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьПотверждениеРегистрацииКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Наименование = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + " " + Пользователь.Наименование + " на регистрацию";
	КонецЦикла;
	
КонецПроцедуры
